IDEA StatiCa Open Model
IGeometryPart Interface
Compatible with IDEA StatiCa Beta 21.0 - beta
 Geotery interface
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public interface IGeometryPart
Public Interface IGeometryPart
public interface class IGeometryPart
The IGeometryPart type exposes the following members.
Properties
Name | Description
Edges
 Lines of input edges on wall or beam
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace